JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_edma.c
    EDMA_ConfigChannelSoftwareTCD(tcd, config);

    if (nextTcd != NULL)
    {
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        tcd->DLAST_SGA = MEMORY_ConvertMemoryMapAddress((uint32_t)nextTcd, kMEMORY_Local2DMA);
#else
        tcd->DLAST_SGA = (uint32_t)nextTcd;
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
        /*
            Before call EDMA_TcdSetTransferConfig or EDMA_SetTransferConfig,
            user must call EDMA_TcdReset or EDMA_ResetChannel which will set
            DREQ, so must use "|" or "&" rather than "=".

            Clear the DREQ bit because scatter gather has been enabled, so the
            previous transfer is not the last transfer, and channel request should
            be enabled at the next transfer(the next TCD).
        */
        tcd->CSR = (tcd->CSR | (uint16_t)DMA_CSR_ESG_MASK) & ~(uint16_t)DMA_CSR_DREQ_MASK;
    }
}

/*!
 * brief Sets TCD fields according to the user's channel transfer configuration structure, see
 * edma4_channel_transfer_config_t.
 *
 * Application should be careful about the TCD pool buffer storage class,
 * - For the platform has cache, the software TCD should be put in non cache section
 * - The TCD pool buffer should have a consistent storage class.
 *
 * param tcd Pointer to the TCD structure.
 * param transfer channel transfer configuration pointer.
 *
 */
void EDMA_ConfigChannelSoftwareTCD(edma_tcd_t *tcd, const edma_transfer_config_t *transfer)
{
    assert(transfer != NULL);
    assert((transfer->minorLoopBytes % (1UL << ((uint32_t)transfer->srcTransferSize))) == 0U);
    assert((transfer->minorLoopBytes % (1UL << ((uint32_t)transfer->destTransferSize))) == 0U);
    assert(((uint32_t)transfer->srcOffset % (1UL << ((uint32_t)transfer->srcTransferSize))) == 0U);
    assert(((uint32_t)transfer->destOffset % (1UL << ((uint32_t)transfer->destTransferSize))) == 0U);
    assert((transfer->srcAddr % (1UL << ((uint32_t)transfer->srcTransferSize))) == 0U);
    assert((transfer->destAddr % (1UL << ((uint32_t)transfer->destTransferSize))) == 0U);
    assert((transfer->srcAddr % (1UL << ((uint32_t)transfer->srcAddrModulo))) == 0U);
    assert((transfer->destAddr % (1UL << ((uint32_t)transfer->dstAddrModulo))) == 0U);

    uint16_t tmpreg;

#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
    tcd->SADDR = MEMORY_ConvertMemoryMapAddress(transfer->srcAddr, kMEMORY_Local2DMA);
    /* destination address */
    tcd->DADDR = MEMORY_ConvertMemoryMapAddress(transfer->destAddr, kMEMORY_Local2DMA);
#else
    tcd->SADDR = transfer->srcAddr;
    /* destination address */
    tcd->DADDR = transfer->destAddr;
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
    /* Source data and destination data transfer size */
    tcd->ATTR = DMA_ATTR_SSIZE(transfer->srcTransferSize) | DMA_ATTR_DSIZE(transfer->destTransferSize);

    /* Source address signed offset */
    tcd->SOFF = (uint16_t)(transfer->srcOffset);
    /* Destination address signed offset */
    tcd->DOFF = (uint16_t)(transfer->destOffset);

    if (((transfer->enableSrcMinorLoopOffset) || (transfer->enableDstMinorLoopOffset)))
    {
        tcd->NBYTES = DMA_NBYTES_MLOFFYES_NBYTES(transfer->minorLoopBytes) |
                      DMA_NBYTES_MLOFFYES_MLOFF(transfer->minorLoopOffset) |
                      DMA_NBYTES_MLOFFYES_DMLOE(transfer->enableDstMinorLoopOffset) |
                      DMA_NBYTES_MLOFFYES_SMLOE(transfer->enableSrcMinorLoopOffset);
    }
    else
    {
        tcd->NBYTES = DMA_NBYTES_MLOFFNO_NBYTES(transfer->minorLoopBytes);
    }

    /* Current major iteration count */
    tcd->CITER = (uint16_t)(transfer->majorLoopCounts);
    /* Starting major iteration count */
    tcd->BITER = (uint16_t)(transfer->majorLoopCounts);
    /* reset CSR firstly */
    tcd->CSR = DMA_CSR_DREQ(true);
    /* Enable scatter/gather processing */
    if (transfer->linkTCD != NULL)
    {
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        tcd->DLAST_SGA = MEMORY_ConvertMemoryMapAddress((uint32_t)transfer->linkTCD, kMEMORY_Local2DMA);
#else
        tcd->DLAST_SGA = (uint32_t)((uint8_t *)transfer->linkTCD);
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
        tcd->CSR |= (uint16_t)DMA_CSR_ESG_MASK;
    }
    else
    {
        tcd->CSR &= ~(uint16_t)DMA_CSR_ESG_MASK;
        tcd->DLAST_SGA = (uint32_t)transfer->dstMajorLoopOffset;
    }

    /* configure interrupt/auto disable channel request */
    tcd->CSR |= (transfer->enabledInterruptMask & (~(uint16_t)kEDMA_ErrorInterruptEnable));

    /* Minor link config */
    if (transfer->enableChannelMinorLoopLink)
    {
        uint16_t tmpreg;

        /* Enable minor link */
        tcd->CITER |= DMA_CITER_ELINKYES_ELINK_MASK;
        tcd->BITER |= DMA_BITER_ELINKYES_ELINK_MASK;
        /* Set linked channel */
        tmpreg = tcd->CITER & (~(uint16_t)DMA_CITER_ELINKYES_LINKCH_MASK);
        tmpreg |= DMA_CITER_ELINKYES_LINKCH(transfer->minorLoopLinkChannel);
        tcd->CITER = tmpreg;
        tmpreg     = tcd->BITER & (~(uint16_t)DMA_BITER_ELINKYES_LINKCH_MASK);
        tmpreg |= DMA_BITER_ELINKYES_LINKCH(transfer->minorLoopLinkChannel);
        tcd->BITER = tmpreg;
    }
    /* Major link config */
    if (transfer->enableChannelMajorLoopLink)
    {
        uint16_t tmpreg;

        /* Enable major link */
        tcd->CSR |= DMA_CSR_MAJORELINK_MASK;
        /* Set major linked channel */
        tmpreg   = tcd->CSR & (~(uint16_t)DMA_CSR_MAJORLINKCH_MASK);
        tcd->CSR = tmpreg | DMA_CSR_MAJORLINKCH(transfer->majorLoopLinkChannel);
    }

    /* clear link relate field if no channel link enabled */
    if ((!transfer->enableChannelMajorLoopLink) && (!transfer->enableChannelMinorLoopLink))
    {
        tcd->CITER &= ~(uint16_t)DMA_CITER_ELINKYES_ELINK_MASK;
        tcd->BITER &= ~(uint16_t)DMA_BITER_ELINKYES_ELINK_MASK;
        tcd->CSR &= ~(uint16_t)DMA_CSR_MAJORELINK_MASK;
    }

    /* major loop offset */
    tcd->SLAST = (uint32_t)transfer->srcMajorLoopOffset;
    /* modulo feature */
    tmpreg    = tcd->ATTR & (~(uint16_t)(DMA_ATTR_SMOD_MASK | DMA_ATTR_DMOD_MASK));
    tcd->ATTR = tmpreg | DMA_ATTR_DMOD(transfer->dstAddrModulo) | DMA_ATTR_SMOD(transfer->srcAddrModulo);
}

/*!
 * brief Configures the eDMA TCD minor offset feature.
 *
 * A minor offset is a signed-extended value added to the source address or a destination
 * address after each minor loop.
 *
 * param tcd A point to the TCD structure.
 * param config A pointer to the minor offset configuration structure.
 */
void EDMA_TcdSetMinorOffsetConfig(edma_tcd_t *tcd, const edma_minor_offset_config_t *config)
{
    assert(tcd != NULL);
    assert(((uint32_t)tcd & 0x1FU) == 0U);

    uint32_t tmpreg;

